docs/ep.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-05-28 Tue 10:59 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Posterior approximation for scRNA-seq data</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Abhishek Sarkar">
<link href="css/bootstrap.min.css" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/supp.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Posterior approximation for scRNA-seq data</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org11d341a">Introduction</a></li>
<li><a href="#org4cf39fa">Idea</a></li>
<li><a href="#org9ebb9ed">Connection to EP</a></li>
</ul>
</div>
</div>

<div id="outline-container-org11d341a" class="outline-2">
<h2 id="org11d341a">Introduction</h2>
<div class="outline-text-2" id="text-org11d341a">
<p>
We are studying the model:
</p>

<p>
\[ x_i \mid s_i, \lambda_i \sim \mathrm{Poisson}(s_i \lambda_i) \]
</p>

<p>
\[ \lambda_i \sim g(\cdot) \]
</p>

<p>
If we consider \(g\) a prior, then estimating \(g\) via maximum likelihood is
Empirical Bayes, and we can recover the posterior distribution \(p(\lambda_i
  \mid x_1, \ldots, x_n)\). What can we do with this distribution?
</p>

<p>
One inference task is to generate Gaussian pseudodata (represented by a mean
and variance) per count observation. One natural way to do this is Taylor
expansion. For one observation, suppose \(l(\theta) = \ln p(x \mid
  \theta)\). Then, taking second-order Taylor expansion about \(\theta_0\):
</p>

<p>
\[ l(\theta) \approx l(\theta_0) + (\theta - \theta_0)\,l'(\theta_0) +
  \frac{(\theta - \theta)^2}{2}\,l''(\theta_0) \]
</p>

<p>
\[= \mathcal{N}\left(\theta_0 - \frac{l'(\theta_0)}{l''(\theta_0)}; \theta,
  -\frac{1}{l''(\theta_0)}\right) + \mathrm{const} \]
</p>

<p>
In our model above, define \(\theta_i = \ln\lambda_i\). Now, the problem
becomes: how do we choose \(\theta_0\)? The obvious choice is \(\ln(x_i /
  s_i)\). However, this choice breaks down for \(x_i = 0\).
</p>

<p>
Here, we investigate whether we can use the posterior distribution of
\(\lambda_i\) to find a better point to expand about. The intuition is that
\(x_i = 0\) does not imply that \(\lambda_i = 0\), and we should use the rest
of the data to regularize (shrink) the \(\lambda_i\) towards each other.
</p>
</div>
</div>

<div id="outline-container-org4cf39fa" class="outline-2">
<h2 id="org4cf39fa">Idea</h2>
<div class="outline-text-2" id="text-org4cf39fa">
<p>
The posterior of interest is
</p>

<p>
\[ p(\lambda_i \mid x_1, \ldots, x_n) \propto \hat{g}(\lambda_i) p(x_i \mid
  \lambda_i) \triangleq P_i \]
</p>

<p>
For each observation \(x_i\), we want to find a new "likelihood" \(q(x_i
  \mid \mu_i, \sigma^2_i)\), such that the resulting approximate posterior
</p>

<p>
\[ \hat{g}(\lambda_i) q(x_i \mid \mu_i, \sigma^2_i) \triangleq Q_i \]
</p>

<p>
is as close to the true posterior as possible. This entails finding \(q^*\):
</p>

<p>
\[ q^* = \arg\min_q \mathcal{KL}\left(P_i \Vert Q_i\right) \]
</p>

<p>
\[ = \arg\max_q \mathbb{E}_{P_i} \left[ \ln Q_i \right] \]
</p>

<p>
\[ = \arg\max_q \mathbb{E}_{P_i} \left[\ln q(x_i \mid \mu_i, \sigma^2_i) \right] \]
</p>

<p>
<b>Is there an easy solution?</b> Suppose \(\hat{g}\) is Gamma with mean \(m\) and
variance \(v\). Then, the optimization is finding a Gaussian MLE for negative
binomial data with mean \(s_i m\) and variance \((s_i m)^2 v\).
</p>

<p>
<b>Is this a sensible solution?</b> Intuitively, we want \(\sigma^2_i\) to capture
uncertainty in the measurement. As \(s_i\) and \(m\) become smaller, we want
\(\sigma^2_i\) to become larger. But the above solution has the exact
opposite property.
</p>

<p>
Further, variation in \(\mu_i\) will only capture variation in \(s_i\), since
\(m\) is assumed to be the same for each observation \(x_i\). This also seems
to defeat the purpose of producing Gaussian pseudodata.
</p>
</div>
</div>

<div id="outline-container-org9ebb9ed" class="outline-2">
<h2 id="org9ebb9ed">Connection to EP</h2>
<div class="outline-text-2" id="text-org9ebb9ed">
<p>
We have:
</p>

<p>
\[ \Pr(\mathbf{x}, \boldsymbol{\lambda}) = \prod_i \hat{g}(\lambda_i) p(x_i \mid \lambda_i) \]
</p>

<p>
where \(p\) is Poisson. We want to approximate this as:
</p>

<p>
\[ \prod_i \hat{g}(\lambda_i) q_i(x_i \mid \mu_i, \sigma^2_i) \]
</p>

<p>
where \(q_i\) is Gaussian. This is an instance of expectation propagation
(<a href="https://tminka.github.io/papers/ep/">Minka 2001</a>), which is phrased in
terms of joint probability distributions instead of posteriors.
</p>

<p>
The difference between general EP and the idea above is that we are fixing
the factors \(\hat{g}(\lambda_i)\). 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Sarkar</p>
<p class="date">Created: 2019-05-28 Tue 10:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
